Documents/бит_бу_НачисленияПоБиллинговымУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>бит_бу_НачисленияПоБиллинговымУслугам</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.бит_бу_НачисленияБиллинговыхУслуг</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЛицевыхСчетов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ1</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ2</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СубконтоКУ3</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетАбонента</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетКУ</Name>
							<Comment>(Регл) </Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/бит_бу_НачисленияБиллинговыхУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_бу_НачисленияБиллинговыхУслуг</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_бу_БиллинговыеУслуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/бит_бу_НачисленияПоБиллинговымУслугам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЭкспортныеПроцедурыИФункции

// БИТ_ЖКХ 22.09.2010. 
// Процедура выполняет заполнение счетов и субконто табличной части.
//
Процедура ЗапролнитьСчета() Экспорт
	
	// Форма = ПолучитьФорму("Документ.бит_бу_НачисленияПоБиллинговымУслугам.Форма.ФормаДокумента",ЭтотОбъект,);
	
	// Форма = ЭтотОбъект.ПолучитьФорму("ФормаДокумента", ЭтотОбъект,);
	
	// Объект.ЛицевыеСчета
	
	
	
	// Колонки = Форма.Элементы.ЛицевыеСчета.Колонки;
	//
	// ЛССписок = ЛицевыеСчета.ВыгрузитьКолонку("ЛицевойСчет");
	//
	// бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ЛицевыеСчета, Колонки, ЛССписок, Организация, Дата);
	
КонецПроцедуры

#КонецОбласти

#Область ОбеспечениеПроведенияДокумента

// Процедура формирует структуру шапки документа и дополнительных полей.
//
Процедура ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ) Экспорт
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
КонецПроцедуры

// Процедура выполняет движения по регистрам.
//
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//  СтруктураТаблиц 		- Структура.
//  Отказ 					- Булево.
//  Заголовок 				- Строка.
//
Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, Отказ, Заголовок)
	
	НаборЗаписейНачисленияБиллинговыхУслуг = Движения.бит_бу_НачисленияБиллинговыхУслуг;
	НаборЗаписейХозрасчетный               = Движения.Хозрасчетный;
	
	Для каждого СтрокаТЧ Из СтруктураТаблиц Цикл
		
		Если СтрокаТЧ.Сумма <> 0 тогда
			
			СтрокаДвижений                   = НаборЗаписейНачисленияБиллинговыхУслуг.Добавить();
			СтрокаДвижений.ВидДвижения       = ВидДвиженияНакопления.Приход;
			СтрокаДвижений.Период            = СтруктураШапкиДокумента.Дата;
			СтрокаДвижений.Организация       = СтруктураШапкиДокумента.Организация;
			СтрокаДвижений.ЛицевойСчет       = СтрокаТЧ.ЛицевойСчет;
			СтрокаДвижений.Услуга            = СтрокаТЧ.Услуга;
			СтрокаДвижений.Сумма             = СтрокаТЧ.Сумма;
			
			Если ЗначениеЗаполнено(СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено(СтрокаТЧ.СчетКУ) Тогда  
				
				Проводка = Движения.Хозрасчетный.Добавить();
				Проводка.Период     = СтруктураШапкиДокумента.Дата;
				Проводка.Содержание = "Начисление по ЛС";
				Проводка.Организация = СтруктураШапкиДокумента.Организация;
				
				Проводка.СчетДт = СтрокаТЧ.СчетАбонента;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.Субконто3);
				Проводка.СчетКт = СтрокаТЧ.СчетКУ;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.СубконтоКУ1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.СубконтоКУ2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.СубконтоКУ3);
				Проводка.Сумма = СтрокаТЧ.Сумма;
				
			КонецЕсли;
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Функция готовит таблицы документа для проведения.
//
// Параметры:
//  СтруктураШапкиДокумента - Структура.
//
// Возвращаемое значение:
//  СтруктураТаблиц - Структура.
//
Функция ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента)  Экспорт
	
	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("ЛицевойСчет"      ,"ЛицевойСчет");
	СтруктураПолей.Вставить("Услуга"           ,"Услуга");
	СтруктураПолей.Вставить("Сумма"            ,"Сумма");
	
	СтруктураПолей.Вставить("СчетАбонента" ,"СчетАбонента");
	СтруктураПолей.Вставить("Субконто1"    ,"Субконто1");
	СтруктураПолей.Вставить("Субконто2"    ,"Субконто2");
	СтруктураПолей.Вставить("Субконто3"    ,"Субконто3");
	СтруктураПолей.Вставить("СчетКУ"       ,"СчетКУ");
	СтруктураПолей.Вставить("СубконтоКУ1"  ,"СубконтоКУ1");
	СтруктураПолей.Вставить("СубконтоКУ2"  ,"СубконтоКУ2");
	СтруктураПолей.Вставить("СубконтоКУ3"  ,"СубконтоКУ3");
	
	РезультатЗапросаПоУслугам = бит_ОбщегоНазначения.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "ЛицевыеСчета", СтруктураПолей);
	
	// Подготовим таблицы услуг для проведения.
	ТаблицаЛицевыеСчета = РезультатЗапросаПоУслугам.Выгрузить();
	
	Возврат ТаблицаЛицевыеСчета;
	
КонецФункции // ПодготовитьТаблицыДокумента()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытий

// Процедура - обработчик события "ОбработкаПроведения".
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем СтруктураШапкиДокумента;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	// Подготовим структуру шапки документа.
	ПодготовитьСтруктуруШапкиДокумента(Заголовок, СтруктураШапкиДокумента, Отказ);
	
	СтруктураТаблиц = ПодготовитьТаблицыДокумента(СтруктураШапкиДокумента);
	
	Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента, СтруктураТаблиц, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события "ОбработкаУдаленияПроведения".
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ, РучнаяКорректировка, Ложь);
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТЗСписокЛС = ЛицевыеСчета.Выгрузить(,"ЛицевойСчет");
	ТЗСписокЛС.Свернуть("ЛицевойСчет");
	
	СписокЛицевыхСчетов = "";
	Для каждого Строка Из ТЗСписокЛС Цикл
		
		Если ПустаяСтрока(Строка.ЛицевойСчет.Наименование) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если СписокЛицевыхСчетов = "" Тогда
			СписокЛицевыхСчетов = ""+Строка.ЛицевойСчет.Наименование;
		Иначе
			СписокЛицевыхСчетов = ""+СписокЛицевыхСчетов +", " +Строка.ЛицевойСчет.Наименование;
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - обработчик события "ПередЗаписью".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
